let city = [
    {
        "list": [
            {
                "code": "miba",
                "type": 1,
                "large_species_name": "Miền Bắc",
                "large_species_code": "NORTH",
                "name": "Miền Bắc",
                "des": "mở thưởng hàng ngày",
                "open_time": "2021-01-20 18:15:00",
                "record": "[\"23677\",\"32856\",\"88201,31483\",\"31721,22939,19393,86338,94480,25520\",\"6750,4933,2122,0719\",\"8448,8313,5584,9527,1697,4703\",\"248,646,116\",\"67,96,55,52\"]",
                "period": "19/01/2021"
            },
            {
                "code": "hano",
                "type": 1,
                "large_species_name": "Miền Bắc",
                "large_species_code": "NORTH",
                "name": "Hà Nội",
                "des": "thứ 2,thứ 5 mở thưởng",
                "open_time": "2021-01-21 18:15:00",
                "record": "[\"92549\",\"96884\",\"06158,89877\",\"24305,53638,12286,37720,42141,51253\",\"8202,1717,2304,7338\",\"0149,9697,0008,4535,1725,0195\",\"494,321,078\",\"59,13,69,23\"]",
                "period": "18/01/2021"
            },
            {
                "code": "bani",
                "type": 1,
                "large_species_name": "Miền Bắc",
                "large_species_code": "NORTH",
                "name": "Bắc Ninh",
                "des": "thứ 4 mở thưởng",
                "open_time": "2021-01-20 18:15:00",
                "record": "[\"02769\",\"38216\",\"11276,94309\",\"64336,21172,87669,76214,95085,69947\",\"7295,0029,4713,7354\",\"8886,7271,3378,9059,4262,2858\",\"188,146,460\",\"13,35,71,99\"]",
                "period": "13/01/2021"
            },
            {
                "code": "haph",
                "type": 1,
                "large_species_name": "Miền Bắc",
                "large_species_code": "NORTH",
                "name": "Hải Phòng",
                "des": "thứ 6 mở thưởng",
                "open_time": "2021-01-22 18:15:00",
                "record": "[\"68285\",\"63497\",\"51148,40526\",\"21460,45322,08942,64777,99903,68603\",\"9743,9831,2616,0548\",\"0880,6314,8728,3229,3228,1896\",\"300,505,685\",\"13,33,47,58\"]",
                "period": "15/01/2021"
            },
            {
                "code": "nadi",
                "type": 1,
                "large_species_name": "Miền Bắc",
                "large_species_code": "NORTH",
                "name": "Nam Định",
                "des": "thứ 7 mở thưởng",
                "open_time": "2021-01-23 18:15:00",
                "record": "[\"12046\",\"58127\",\"13716,13938\",\"97864,15467,16200,33137,19032,27560\",\"4741,9668,7808,4797\",\"5608,8792,4534,1448,0349,2861\",\"968,825,724\",\"15,76,85,71\"]",
                "period": "16/01/2021"
            },
            {
                "code": "quni",
                "type": 1,
                "large_species_name": "Miền Bắc",
                "large_species_code": "NORTH",
                "name": "Quảng Ninh",
                "des": "thứ 3 mở thưởng",
                "open_time": "2021-01-26 18:15:00",
                "record": "[\"23677\",\"32856\",\"88201,31483\",\"31721,22939,19393,86338,94480,25520\",\"6750,4933,2122,0719\",\"8448,8313,5584,9527,1697,4703\",\"248,646,116\",\"67,96,55,52\"]",
                "period": "19/01/2021"
            },
            {
                "code": "thbi",
                "type": 1,
                "large_species_name": "Miền Bắc",
                "large_species_code": "NORTH",
                "name": "Thái Bình",
                "des": "chủ nhật mở thưởng",
                "open_time": "2021-01-24 18:15:00",
                "record": "[\"55095\",\"58464\",\"65216,77011\",\"19594,34767,57701,76863,70980,54862\",\"8664,4091,1436,8925\",\"5408,7165,1651,1712,1770,4474\",\"002,600,566\",\"43,98,97,87\"]",
                "period": "17/01/2021"
            }
        ],
        "name": "Miền Bắc"
    },
    {
        "list": [
            {
                "code": "bali",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "Bạc Liêu",
                "des": "mở thưởng hàng ngày",
                "open_time": "2021-01-26 16:15:00",
                "record": "[\"632615\",\"35596\",\"99453\",\"55940,88457\",\"59512,13344,60274,26690,63121,60556,95505\",\"4487\",\"8796,8479,1760\",\"165\",\"60\"]",
                "period": "19/01/2021"
            },
            {
                "code": "vuta",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "Vũng Tàu",
                "des": "thứ 3 mở thưởng",
                "open_time": "2021-01-26 16:15:00",
                "record": "[\"502962\",\"92041\",\"74916\",\"09766,15281\",\"91757,85876,50759,77157,70133,92589,61181\",\"0528\",\"6678,5209,5980\",\"697\",\"67\"]",
                "period": "19/01/2021"
            },
            {
                "code": "tigi",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "Tiền Giang",
                "des": "chủ nhật mở thưởng",
                "open_time": "2021-01-24 16:15:00",
                "record": "[\"468007\",\"78646\",\"17074\",\"81013,25109\",\"76932,44016,31386,84419,12864,04408,41985\",\"7280\",\"9969,3911,4114\",\"322\",\"16\"]",
                "period": "17/01/2021"
            },
            {
                "code": "kigi",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "Kiên Giang",
                "des": "chủ nhật mở thưởng",
                "open_time": "2021-01-24 16:15:00",
                "record": "[\"763087\",\"14207\",\"14929\",\"31117,99654\",\"42439,77273,45530,41808,61692,27732,09767\",\"3387\",\"5810,6451,8553\",\"080\",\"26\"]",
                "period": "17/01/2021"
            },
            {
                "code": "dalat",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "Đà Lạt",
                "des": "chủ nhật mở thưởng",
                "open_time": "2021-01-24 16:15:00",
                "record": "[\"149641\",\"50019\",\"28520\",\"33347,71549\",\"27563,10811,63974,25821,82905,78904,71558\",\"0987\",\"8833,8476,7197\",\"932\",\"79\"]",
                "period": "17/01/2021"
            },
            {
                "code": "biph",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "Bình Phước",
                "des": "thứ 7 mở thưởng",
                "open_time": "2021-01-23 16:15:00",
                "record": "[\"694662\",\"07979\",\"30816\",\"86609,31441\",\"07124,97494,59280,27019,99870,46305,54326\",\"3784\",\"7101,8953,8386\",\"884\",\"07\"]",
                "period": "16/01/2021"
            },
            {
                "code": "bidu",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "Bình Dương",
                "des": "thứ 6 mở thưởng",
                "open_time": "2021-01-22 16:15:00",
                "record": "[\"373408\",\"80023\",\"27704\",\"60646,25991\",\"39607,30434,74026,25253,06545,29716,94949\",\"6515\",\"0583,4107,2687\",\"664\",\"39\"]",
                "period": "15/01/2021"
            },
            {
                "code": "angi",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "An Giang",
                "des": "thứ 5 mở thưởng",
                "open_time": "2021-01-21 16:15:00",
                "record": "[\"351685\",\"85049\",\"98516\",\"37382,40591\",\"03955,49370,05426,57487,07814,28935,75708\",\"0243\",\"6115,6031,8129\",\"841\",\"04\"]",
                "period": "14/01/2021"
            },
            {
                "code": "bith",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "Bình Thuậ",
                "des": "thứ 5 mở thưởng",
                "open_time": "2021-01-21 16:15:00",
                "record": "[\"279246\",\"28749\",\"24725\",\"63025,77287\",\"84519,71645,72984,30876,59400,23476,67382\",\"2075\",\"1602,1492,1300\",\"172\",\"21\"]",
                "period": "14/01/2021"
            },
            {
                "code": "cama",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "Cà Mau",
                "des": "thứ 2 mở thưởng",
                "open_time": "2021-01-25 16:15:00",
                "record": "[\"500868\",\"88106\",\"17826\",\"15582,61545\",\"08410,32689,65788,90813,06619,91708,88535\",\"5198\",\"1793,5507,0022\",\"832\",\"87\"]",
                "period": "18/01/2021"
            },
            {
                "code": "cath",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "Cần Thơ",
                "des": "thứ 4 mở thưởng",
                "open_time": "2021-01-20 16:15:00",
                "record": "[\"066968\",\"81586\",\"88110\",\"00616,93207\",\"44663,65206,64540,76411,82903,76699,86419\",\"1325\",\"5164,8260,5570\",\"362\",\"39\"]",
                "period": "13/01/2021"
            },
            {
                "code": "hagi",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "Hậu Giang",
                "des": "thứ 7 mở thưởng",
                "open_time": "2021-01-23 16:15:00",
                "record": "[\"943293\",\"26109\",\"01849\",\"63605,86436\",\"94590,26673,57725,64287,72736,28542,42130\",\"7676\",\"5861,0086,8917\",\"244\",\"19\"]",
                "period": "16/01/2021"
            },
            {
                "code": "doth",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "Đồng Tháp",
                "des": "thứ 2 mở thưởng",
                "open_time": "2021-01-25 16:15:00",
                "record": "[\"301747\",\"64825\",\"30247\",\"33689,90896\",\"93471,32355,35285,44604,10854,77308,15375\",\"5346\",\"3754,5055,2629\",\"264\",\"69\"]",
                "period": "18/01/2021"
            },
            {
                "code": "tani",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "Tây Ninh",
                "des": "thứ 5 mở thưởng",
                "open_time": "2021-01-21 16:15:00",
                "record": "[\"060206\",\"56349\",\"72841\",\"13225,65351\",\"31696,89759,59705,85599,80280,00688,55357\",\"4613\",\"1026,2681,1732\",\"649\",\"75\"]",
                "period": "14/01/2021"
            },
            {
                "code": "vilo",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "Vĩnh Long",
                "des": "thứ 6 mở thưởng",
                "open_time": "2021-01-22 16:15:00",
                "record": "[\"753821\",\"56178\",\"69294\",\"53878,32267\",\"94639,56524,07188,34311,59713,29579,29817\",\"5605\",\"5111,9371,7488\",\"747\",\"69\"]",
                "period": "15/01/2021"
            },
            {
                "code": "trvi",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "Trà Vinh",
                "des": "thứ 6 mở thưởng",
                "open_time": "2021-01-22 16:15:00",
                "record": "[\"295088\",\"01440\",\"47614\",\"48021,43255\",\"99186,56436,13968,54128,12763,08189,00807\",\"5696\",\"3046,3563,9737\",\"621\",\"61\"]",
                "period": "15/01/2021"
            },
            {
                "code": "sotr",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "Sóc Trăng",
                "des": "thứ 4 mở thưởng",
                "open_time": "2021-01-20 16:15:00",
                "record": "[\"180585\",\"72476\",\"34112\",\"38633,91246\",\"84432,87560,19685,23941,92071,64314,15793\",\"4847\",\"6053,8500,8331\",\"037\",\"38\"]",
                "period": "13/01/2021"
            },
            {
                "code": "tphc",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "TP. HCM",
                "des": "thứ 2,thứ 7 mở thưởng",
                "open_time": "2021-01-23 16:15:00",
                "record": "[\"777204\",\"10127\",\"52279\",\"79682,68014\",\"22396,51917,40556,07877,77927,32803,87517\",\"0521\",\"9684,5220,0584\",\"349\",\"64\"]",
                "period": "18/01/2021"
            },
            {
                "code": "dona",
                "type": 1,
                "large_species_name": "Miền Nam",
                "large_species_code": "SOUTH",
                "name": "Đồng Nai",
                "des": "thứ 4 mở thưởng",
                "open_time": "2021-01-20 16:15:00",
                "record": "[\"780398\",\"25704\",\"91159\",\"07283,72510\",\"80061,71805,78083,30816,87871,79278,31606\",\"8988\",\"7774,4682,4037\",\"587\",\"14\"]",
                "period": "13/01/2021"
            }
        ],
        "name": "Miền Nam"
    },
    {
        "list": [
            {
                "code": "dana",
                "type": 1,
                "large_species_name": "Miền Trung",
                "large_species_code": "MID",
                "name": "Đà Nẵng",
                "des": "thứ 4,thứ 7 mở thưởng",
                "open_time": "2021-01-20 17:15:00",
                "record": "[\"729537\",\"68119\",\"24808\",\"98283,44378\",\"97508,39733,72393,16615,78502,02424,37703\",\"0997\",\"4141,2308,6128\",\"024\",\"42\"]",
                "period": "16/01/2021"
            },
            {
                "code": "thth",
                "type": 1,
                "large_species_name": "Miền Trung",
                "large_species_code": "MID",
                "name": "Thừa T. Huế",
                "des": "thứ 2 mở thưởng",
                "open_time": "2021-01-25 17:15:00",
                "record": "[\"103791\",\"68470\",\"78351\",\"25176,25620\",\"30108,20633,62939,75521,14156,72257,57828\",\"3544\",\"9661,1499,6108\",\"052\",\"89\"]",
                "period": "18/01/2021"
            },
            {
                "code": "qutr",
                "type": 1,
                "large_species_name": "Miền Trung",
                "large_species_code": "MID",
                "name": "Quảng Trị",
                "des": "thứ 5 mở thưởng",
                "open_time": "2021-01-21 17:15:00",
                "record": "[\"414048\",\"04004\",\"75336\",\"52275,05616\",\"42173,09609,86623,34133,00074,45660,55934\",\"5366\",\"8822,4588,2304\",\"671\",\"81\"]",
                "period": "14/01/2021"
            },
            {
                "code": "phye",
                "type": 1,
                "large_species_name": "Miền Trung",
                "large_species_code": "MID",
                "name": "Phú Yên",
                "des": "thứ 2 mở thưởng",
                "open_time": "2021-01-25 17:15:00",
                "record": "[\"266089\",\"20248\",\"49929\",\"98418,49149\",\"44338,03911,78165,21716,07393,30357,71123\",\"8568\",\"7986,7401,5410\",\"599\",\"88\"]",
                "period": "18/01/2021"
            },
            {
                "code": "qubi",
                "type": 1,
                "large_species_name": "Miền Trung",
                "large_species_code": "MID",
                "name": "Quảng Bình",
                "des": "thứ 5 mở thưởng",
                "open_time": "2021-01-21 17:15:00",
                "record": "[\"354957\",\"17031\",\"61009\",\"04377,73382\",\"93538,51187,07524,64212,75649,65687,25053\",\"9375\",\"8744,8770,8736\",\"065\",\"20\"]",
                "period": "14/01/2021"
            },
            {
                "code": "quna",
                "type": 1,
                "large_species_name": "Miền Trung",
                "large_species_code": "MID",
                "name": "Quảng Nam",
                "des": "thứ 3 mở thưởng",
                "open_time": "2021-01-26 17:15:00",
                "record": "[\"995411\",\"16618\",\"15020\",\"95563,17323\",\"58441,21762,58402,33808,45678,07540,83536\",\"2334\",\"8338,5790,9534\",\"233\",\"79\"]",
                "period": "19/01/2021"
            },
            {
                "code": "qung",
                "type": 1,
                "large_species_name": "Miền Trung",
                "large_species_code": "MID",
                "name": "Quảng Ngãi",
                "des": "thứ 7 mở thưởng",
                "open_time": "2021-01-23 17:15:00",
                "record": "[\"631761\",\"30829\",\"32767\",\"70836,82497\",\"33424,82685,61366,58679,32091,65876,21845\",\"0332\",\"9381,9383,9091\",\"872\",\"72\"]",
                "period": "16/01/2021"
            },
            {
                "code": "nith",
                "type": 1,
                "large_species_name": "Miền Trung",
                "large_species_code": "MID",
                "name": "Ninh Thuận",
                "des": "thứ 6 mở thưởng",
                "open_time": "2021-01-22 17:15:00",
                "record": "[\"014540\",\"21650\",\"90495\",\"41395,47148\",\"13812,01771,14613,68337,00787,98967,16895\",\"2263\",\"4644,5353,8693\",\"290\",\"36\"]",
                "period": "15/01/2021"
            },
            {
                "code": "kotu",
                "type": 1,
                "large_species_name": "Miền Trung",
                "large_species_code": "MID",
                "name": "Kon Tum",
                "des": "chủ nhật mở thưởng",
                "open_time": "2021-01-24 17:15:00",
                "record": "[\"326448\",\"97187\",\"72658\",\"02723,12227\",\"60430,60671,87886,14061,92776,48001,59487\",\"0252\",\"6478,1681,7613\",\"568\",\"12\"]",
                "period": "17/01/2021"
            },
            {
                "code": "khho",
                "type": 1,
                "large_species_name": "Miền Trung",
                "large_species_code": "MID",
                "name": "Khánh Hòa",
                "des": "thứ 4,chủ nhật mở thưởng",
                "open_time": "2021-01-20 17:15:00",
                "record": "[\"921507\",\"82246\",\"36922\",\"29848,86240\",\"31390,29125,70699,99817,41187,60157,30794\",\"7665\",\"2174,9118,2720\",\"881\",\"97\"]",
                "period": "17/01/2021"
            },
            {
                "code": "gila",
                "type": 1,
                "large_species_name": "Miền Trung",
                "large_species_code": "MID",
                "name": "Gia Lai",
                "des": "thứ 6 mở thưởng",
                "open_time": "2021-01-22 17:15:00",
                "record": "[\"091778\",\"47118\",\"08840\",\"50704,14888\",\"17455,52012,68245,92739,41238,87586,24266\",\"9445\",\"4543,0983,2206\",\"866\",\"09\"]",
                "period": "15/01/2021"
            },
            {
                "code": "bidi",
                "type": 1,
                "large_species_name": "Miền Trung",
                "large_species_code": "MID",
                "name": "Bình Định",
                "des": "thứ 5 mở thưởng",
                "open_time": "2021-01-21 17:15:00",
                "record": "[\"979812\",\"97274\",\"05613\",\"61074,24806\",\"87899,57918,05658,40209,18518,09718,77303\",\"4551\",\"1075,8274,6474\",\"818\",\"71\"]",
                "period": "14/01/2021"
            },
            {
                "code": "dalak",
                "type": 1,
                "large_species_name": "Miền Trung",
                "large_species_code": "MID",
                "name": "Đắk Lắk",
                "des": "thứ 4 mở thưởng",
                "open_time": "2021-01-26 17:15:00",
                "record": "[\"493258\",\"57336\",\"82935\",\"77331,50643\",\"72302,86338,70137,41423,01520,01837,18412\",\"8450\",\"1403,0397,4652\",\"333\",\"03\"]",
                "period": "19/01/2021"
            },
            {
                "code": "dano",
                "type": 1,
                "large_species_name": "Miền Trung",
                "large_species_code": "MID",
                "name": "Đắk Nông",
                "des": "thứ 7 mở thưởng",
                "open_time": "2021-01-23 17:15:00",
                "record": "[\"060778\",\"12536\",\"36784\",\"15588,22872\",\"95930,91597,63234,55650,86215,71880,70507\",\"5283\",\"1684,4683,9040\",\"485\",\"38\"]",
                "period": "16/01/2021"
            }
        ],
        "name": "Miền Trung"
    }
]


function getExpand() {
    let minArr = []
    city.map(item => {
        item.list.map(cell => {
            minArr.push(cell)
        })
    })
    return minArr
}

function getDreiction(param) {
    let classify = {}
    city.map(item => {
        classify[item.name] = item.list
    })
    if(param) return classify[param]
    return classify
}


export { getExpand, getDreiction }
export default city